*** Download trusted certificate files.

   #+BEGIN_SRC shell :results verbatim :var TRUSTED_CERTS=gitlab-trusted-certs
     for url in "${!TRUSTED_CERTS[@]}"; do

         METHOD=${TRUSTED_CERTS[$url]#*$'\n'}

         if [ ${METHOD} == 'curl' ]; then
             echo "Downloading $url - Method <${METHOD}> is curl"
             curl $url | openssl x509 -inform der -outform pem > ${TRUSTED_CERTS[$url]%$'\n'*}
         elif [ ${METHOD} == 'openssl' ]; then
             echo "Downloading $url - Method <${METHOD}> is openssl"
             openssl s_client -showcerts -connect $url </dev/null 2>/dev/null | openssl x509 -outform PEM > ${TRUSTED_CERTS[$url]%$'\n'*}
         else
             echo "Skipping $url - Method <${METHOD}> is unknown"
         fi

     done
   #+END_SRC

   #+RESULTS:
   : Downloading http://example.com/xyz.crt - Method <curl> is curl
   : Downloading example.net:443 - Method <openssl> is openssl
   : Downloading example.org:443 - Method <openssl> is openssl

** Install GitLab Packages

# Need to find better way to get the filename values from multiple tables in org file

#+NAME: install-gitlab/gen-gitlab-packages-filenames-lines
#+BEGIN_SRC ruby :var data=gitlab-packages :results drawer replace 
  output = <<-BLOCK_TEMPLATE

  ,#+NAME: install-gitlab/gen-gitlab-packages-filenames-lines-shell-code
  ,#+BEGIN_SRC shell :noweb yes :eval never
  #{data.map{|d| %Q^<<elisp/get-property-value(property-name="Filename",data=#{d[0]})>>^ }.uniq.join(" ")}
  ,#+END_SRC
  BLOCK_TEMPLATE
#+END_SRC

#+RESULTS: install-gitlab/gen-gitlab-packages-filenames-lines
:RESULTS:

#+NAME: install-gitlab/gen-gitlab-packages-filenames-lines-shell-code
#+BEGIN_SRC shell :noweb yes :eval never
<<elisp/get-property-value(property-name="Filename",data=gitlab-ce-server-package-info)>> <<elisp/get-property-value(property-name="Filename",data=gitlab-ci-multi-runner-package-info)>>
#+END_SRC
:END:

#+NAME: install-gitlab/gen-install-gitlab-packages-shell-code
#+BEGIN_SRC shell :eval never :noweb yes 
  #
  # Install GitLab Packages
  #
  for filename in <<install-gitlab/gen-gitlab-packages-filenames-lines-shell-code>>; do
      ${YUM_CMD} localinstall -y ${filename}
  done
#+END_SRC

